#Целочисленный тип данных
#Преобразование строки к целому числу
#Операции над целыми числами
#Частые ошибки

num1 = 10 
num2 = 3
sum = num1 + num2
print("sum = ", sum)

# Основные операторы в Python (+, -, *, /)
a = 3
b = 4
print(f"Сложение: {a} + {b} = {a + b}")
print(f"Вычетание: {a} - {b} = {a - b}")
print(f"Умножение: {a} * {b} = {a * b}")
print(f"Деление: {a} / {b} = {a / b}")
print(f"Целочисленное деление: {a} // {b} = {a // b}")
print(f"Остаток от деления: {a} % {b} = {a % b}")
print(f"Возведение в степень: {a} ** {b} = {a ** b}")
print(f"Сложение с присваиванием: a += b -> a = {a} + {b} = {a + b}")
a += b 
print(f"Новое значение a: {a}")