print("Я изучаю Python!")
#Аргументы функции
#Аргументы – это конкретные значения, которые вы передаете функции при ее вызове.
print('Я', 'изучаю', 'Python!')
#Один пробел между аргументами
print('1', '2', '3', '4', '5')
print('В тексте есть "двойные" ковычки')

#Ввод данных
#Команда input() всегда пишется с круглыми скобками. 
# Она работает так: когда программа доходит до места, где есть input(), 
# она ждет, пока пользователь введет текст с клавиатуры (ввод завершается нажатием клавиши Enter). 
# Введенная строка подставляется на место input().
print('Как тебя зовут?')
print('Притет!', input())
#Ввод переменной
name = input('Как тебя зовут? 2 - ')
print('Вы ввели:', name)
